from aiogram import F, Router, types
from aiogram.fsm.context import FSMContext
from ..keyboards.inline_keyboards import goto_main_menu_kb
from bot.modules.main_menu import ABOUT_PRODUCT_CALL


router = Router()


@router.callback_query(F.data == ABOUT_PRODUCT_CALL)
async def callback_menu(callback: types.CallbackQuery, state: FSMContext):
    await callback.answer()
    text = (
        "<b>Здесь всё довольно просто.</b>\n\n"
        "Этот чат — для <i>обычных дней</i> и <i>непростых моментов</i>,\n"
        "когда не хочется оставаться наедине с мыслями.\n\n"
        "<b>Я могу:</b>\n"
        "• писать тебе утром и вечером\n"
        "• выходить на связь сам\n"
        "• помнить важные для тебя вещи\n"
        "• поддерживать, когда трудно\n"
        "• быть спокойным собеседником без оценок и советов\n\n"
        "<i>Со временем я буду проводить короткие тесты в течение недели</i> —\n"
        "чтобы ты лучше замечал, что с тобой происходит.\n\n"
        "<i>Они будут незаметны для тебя</i>, а результат ты будешь получать в конце каждой недели.\n\n"
        "<b>Ты получаешь понятные результаты</b> и спокойные комментарии о том,\n"
        "на что сейчас стоит обратить внимание в жизни.\n\n"
        "<i>Без диагнозов, без терапии и без давления.</i>\n\n"
        "<b>Это не лечение.</b>\n"
        "Скорее привычка, которая делает состояние яснее и спокойнее. 🌿"
    )
    await callback.message.edit_text(text, reply_markup=goto_main_menu_kb)
    await state.clear()
